#pragma once

PluginHandle g_pluginHandle = kPluginHandle_Invalid;
NVSESerializationInterface *g_serialization;
NVSEScriptInterface *g_script;
NVSEStringVarInterface *g_string;
NVSEArrayVarInterface *g_array;

#define ExtractArgsEx(...) g_script->ExtractArgsEx(__VA_ARGS__)
#define ExtractFormatStringArgs(...) g_script->ExtractFormatStringArgs(__VA_ARGS__)

// 10
class ExtraFollower : public BSExtraData
{
public:
	ExtraFollower();
	virtual ~ExtraFollower();

	tList<Character>	*followers;	// 0C
};
STATIC_ASSERT(sizeof(ExtraFollower) == 0x10);

// 14
class ExtraEnableStateChildren : public BSExtraData
{
public:
	ExtraEnableStateChildren();
	virtual ~ExtraEnableStateChildren();

	tList<TESObjectREFR>	children;	// 0C
};
STATIC_ASSERT(sizeof(ExtraEnableStateChildren) == 0x14);

// 10
class ExtraLinkedRef : public BSExtraData
{
public:
	ExtraLinkedRef();
	virtual ~ExtraLinkedRef();

    TESObjectREFR	*linkedRef;	// 0C
};
STATIC_ASSERT(sizeof(ExtraLinkedRef) == 0x10);

// 14
class ExtraLinkedRefChildren : public BSExtraData
{
public:
	ExtraLinkedRefChildren();
	virtual ~ExtraLinkedRefChildren();

	tList<TESObjectREFR>	children;	// 0C
};
STATIC_ASSERT(sizeof(ExtraLinkedRefChildren) == 0x14);

// 10
class ExtraPersistentCell : public BSExtraData
{
public:
	ExtraPersistentCell();
	virtual ~ExtraPersistentCell();

	TESObjectCELL	*persistentCell;	// 0C
};
STATIC_ASSERT(sizeof(ExtraPersistentCell) == 0x10);

// 10
class ExtraMerchantContainer : public BSExtraData
{
public:
	ExtraMerchantContainer();
	virtual ~ExtraMerchantContainer();

	TESObjectREFR	*containerRef;	// 0C
};
STATIC_ASSERT(sizeof(ExtraMerchantContainer) == 0x10);

// 34/4C
class BGSPrimitive
{
public:
	BGSPrimitive();
	~BGSPrimitive();

	UInt32		vtbl;		// 00
	UInt32		type;		// 04
	float		unk08[4];	// 08
	float		bounds[3];	// 18
	UInt32		unk24[4];	// 24
};

// 10
class ExtraPrimitive : public BSExtraData
{
public:
	ExtraPrimitive();
	virtual ~ExtraPrimitive();

	BGSPrimitive	*primitive;		// 0C
};
STATIC_ASSERT(sizeof(ExtraPrimitive) == 0x10);

// 08
class NiObject : public NiRefObject
{
public:
	NiObject();
	~NiObject();
};
STATIC_ASSERT(sizeof(NiObject) == 0x8);

// 18
class BSTempEffect : public NiObject
{
public:
	BSTempEffect();
	~BSTempEffect();

	float			duration;	// 08
	TESObjectCELL	*cell;		// 0C
	UInt32			unk10[2];	// 10
};
STATIC_ASSERT(sizeof(BSTempEffect) == 0x18);

// 28
class MagicHitEffect : public BSTempEffect
{
public:
	MagicHitEffect();
	~MagicHitEffect();

	UInt32			unk18;		// 18
	TESObjectREFR	*target;	// 1C
	UInt32			unk20[2];	// 20
};
STATIC_ASSERT(sizeof(MagicHitEffect) == 0x28);

// 4C
class MagicShaderHitEffect : public MagicHitEffect
{
public:
	MagicShaderHitEffect();
	~MagicShaderHitEffect();

	UInt32				unk28[2];			// 28
	TESEffectShader		*effectShader;		// 30
	UInt32				unk34[6];			// 34
};
STATIC_ASSERT(sizeof(MagicShaderHitEffect) == 0x4C);

class ActorProcessManager
{
public:
	ActorProcessManager();
	~ActorProcessManager();

	UInt32					unk00[24];		// 00
	tList<BSTempEffect>		tempEffects;	// 60
};

// 150
class Projectile : public MobileObject
{
public:
	Projectile();
	~Projectile();

	UInt32			unk088[2];		// 088
	float			unk090[14];		// 090
	UInt32			unk0C8;			// 0C8
	float			speedMult1;		// 0CC
	float			speedMult2;		// 0D0
	float			unk0D4;			// 0D4
	float			elapsedTime;	// 0D8
	float			hitDamage;		// 0DC
	float			unk0E0[6];		// 0E0
	TESObjectWEAP	*sourceWeap;	// 0F8
	TESObjectREFR	*sourceRef;		// 0FC
	float			unk100[4];		// 100
	float			distTravelled;	// 110
	UInt32			unk114[15];		// 114
};
STATIC_ASSERT(sizeof(Projectile) == 0x150);

// 154
class BeamProjectile : public Projectile
{
public:
	BeamProjectile();
	~BeamProjectile();

	UInt32		unk150;		// 150
};

// 158
class ContinuousBeamProjectile : public Projectile
{
public:
	ContinuousBeamProjectile();
	~ContinuousBeamProjectile();

	UInt32		unk150[2];	// 150
};

// 158
class FlameProjectile : public Projectile
{
public:
	FlameProjectile();
	~FlameProjectile();

	UInt32		unk150[2];	// 150
};

// 154
class GrenadeProjectile : public Projectile
{
public:
	GrenadeProjectile();
	~GrenadeProjectile();

	UInt32		unk150;		// 150
};

// 160
class MissileProjectile : public Projectile
{
public:
	MissileProjectile();
	~MissileProjectile();

	UInt32		unk150[4];	// 150
};

struct MenuItemEntry
{
	Tile								*unkTile;
	ExtraContainerChanges::EntryData	*entry;
};
typedef BSSimpleList<MenuItemEntry> MenuItemEntryList;

// 124
class InventoryMenu : public Menu	// 1002
{
public:
	InventoryMenu();
	~InventoryMenu();

	TileRect			*unk028;		// 028
	TileRect			*unk02C;		// 02C
	TileRect			*unk030;		// 030
	TileRect			*unk034;		// 034
	TileImage			*unk038;		// 038
	TileRect			*unk03C;		// 03C
	TileImage			*unk040;		// 040
	TileImage			*unk044;		// 044
	TileImage			*unk048;		// 048
	TileImage			*unk04C;		// 04C
	TileImage			*unk050;		// 050
	TileImage			*unk054;		// 054
	TileRect			*unk058;		// 058
	TileRect			*unk05C;		// 05C
	TileRect			*unk060;		// 060
	TileRect			*unk064;		// 064
	TileRect			*unk068;		// 068
	TileRect			*unk06C;		// 06C
	TileRect			*unk070;		// 070
	TileImage			*unk074;		// 074
	TileImage			*unk078;		// 078
	TileRect			*unk07C;		// 07C
	TileText			*unk080;		// 080
	UInt32				filter;			// 084
	UInt32				unk088[12];		// 088
	MenuItemEntryList	items;			// 0B8
	TileImage			*unk0C4;		// 0C4
	TileRect			*unk0C8;		// 0C8
	TileImage			*unk0CC;		// 0CC
	UInt32				unk0D0[6];		// 0D0
	TileRect			*unk0E8;		// 0E8
	TileRect			*unk0EC;		// 0EC
	TileRect			*unk0F0;		// 0F0
	TileRect			*unk0F4;		// 0F4
	TileRect			*unk0F8;		// 0F8
	TileRect			*unk0FC;		// 0FC
	TileRect			*unk100;		// 100
	TileRect			*unk104;		// 104
	TileRect			*unk108;		// 108
	UInt32				unk10C[6];		// 10C
};
STATIC_ASSERT(sizeof(InventoryMenu) == 0x124);

// 10C
class ContainerMenu : public Menu	// 1008
{
public:
	ContainerMenu();
	~ContainerMenu();

	TileImage			*unk028;		// 028
	TileText			*unk02C;		// 02C
	TileImage			*unk030;		// 030
	TileText			*unk034;		// 034
	TileImage			*unk038;		// 038
	TileImage			*unk03C;		// 03C
	TileText			*unk040;		// 040
	TileImage			*unk044;		// 044
	TileImage			*unk048;		// 048
	TileImage			*unk04C;		// 04C
	TileImage			*unk050;		// 050
	TileImage			*unk054;		// 054
	TileImage			*unk058;		// 058
	TileRect			*unk05C;		// 05C
	TileRect			*unk060;		// 060
	TileRect			*unk064;		// 064
	TileRect			*unk068;		// 068
	TileRect			*unk06C;		// 06C
	TileRect			*unk070;		// 070
	TESObjectREFR		*containerRef;	// 074
	UInt32				unk078[5];		// 078
	UInt32				leftFilter;		// 08C
	UInt32				rightFilter;	// 090
	UInt32				unk094;			// 094
	MenuItemEntryList	leftItems;		// 098
	TileImage			*unk0A4;		// 0A4
	TileImage			*leftActive;	// 0A8
	TileImage			*unk0AC;		// 0AC
	UInt32				unk0B0;			// 0B0
	UInt16				leftCount;		// 0B4
	UInt16				unk0B6;			// 0B6
	UInt32				unk0B8[4];		// 0B8
	MenuItemEntryList	rightItems;		// 0C8
	TileImage			*unk0D4;		// 0D4
	TileImage			*rightActive;	// 0D8
	TileImage			*unk0DC;		// 0DC
	UInt32				unk0E0;			// 0E0
	UInt16				rightCount;		// 0E4
	UInt16				unk0E6;			// 0E6
	UInt32				unk0E8[4];		// 0E8
	MenuItemEntryList	*currentItems;	// 0F8
	UInt32				unk0FC[4];		// 0FC
};
STATIC_ASSERT(sizeof(ContainerMenu) == 0x10C);

// 13C
class DialogMenu : public Menu	// 1009
{
public:
	DialogMenu();
	~DialogMenu();

	UInt32				unk028[22];		// 028
	TESObjectREFR		*partnerRef;	// 080
	UInt32				unk084[46];		// 084
};
STATIC_ASSERT(sizeof(DialogMenu) == 0x13C);

// 0E4
class LockPickMenu : public Menu	// 1014
{
public:
	LockPickMenu();
	~LockPickMenu();

	UInt32				unk028[17];		// 028
	TESObjectREFR		*targetRef;		// 06C
	UInt32				unk070[29];		// 070
};
STATIC_ASSERT(sizeof(LockPickMenu) == 0xE4);

typedef tList<ExtraContainerChanges::EntryData> BarterItemList;

// 120
class BarterMenu : public Menu	// 1053
{
public:
	BarterMenu();
	~BarterMenu();

	TileImage			*unk028;		// 028
	TileImage			*unk02C;		// 02C
	TileImage			*unk030;		// 030
	TileText			*unk034;		// 034
	TileImage			*unk038;		// 038
	TileText			*unk03C;		// 03C
	TileImage			*unk040;		// 040
	TileImage			*unk044;		// 044
	TileText			*unk048;		// 048
	TileImage			*unk04C;		// 04C
	TileText			*unk050;		// 050
	TileImage			*unk054;		// 054
	TileRect			*unk058;		// 058
	TileImage			*unk05C;		// 05C
	TileRect			*unk060;		// 060
	TileRect			*unk064;		// 064
	TileRect			*unk068;		// 068
	TileRect			*unk06C;		// 06C
	TileRect			*unk070;		// 070
	TileImage			*unk074;		// 074
	TileImage			*unk078;		// 078
	TileRect			*unk07C;		// 07C
	TESObjectREFR		*merchantRef;	// 080
	float				barterTotalSum;	// 084
	UInt32				unk088;			// 084
	UInt32				playerGold;		// 08C
	UInt32				merchantGold;	// 090
	UInt32				unk094[2];		// 094
	UInt32				leftFilter;		// 09C
	UInt32				rightFilter;	// 0A0
	UInt32				unk0A4;			// 0A4
	MenuItemEntryList	leftItems;		// 0A8
	TileImage			*unk0B4;		// 0B4
	TileImage			*leftActive;	// 0B8
	TileImage			*unk0BC;		// 0BC
	UInt32				unk0C0;			// 0C0
	UInt16				leftCount;		// 0C4
	UInt16				unk0C6;			// 0C6
	UInt32				unk0C8[4];		// 0C8
	MenuItemEntryList	rightItems;		// 0D8
	TileImage			*unk0E4;		// 0E4
	TileImage			*rightActive;	// 0E8
	TileImage			*unk0EC;		// 0EC
	UInt32				unk0F0;			// 0F0
	UInt16				rightCount;		// 0F4
	UInt16				unk0F6;			// 0F6
	UInt32				unk0F8[4];		// 0F8
	MenuItemEntryList	*currentItems;	// 108
	BarterItemList		leftBarter;		// 10C
	BarterItemList		rightBarter;	// 114
	UInt32				unk11C;			// 11C
};
STATIC_ASSERT(sizeof(BarterMenu) == 0x120);

// 1DC
class HackingMenu : public Menu	// 1055
{
public:
	HackingMenu();
	~HackingMenu();

	UInt32				unk028[92];		// 028
	TESObjectREFR		*targetRef;		// 198
	UInt32				unk19C[16];		// 028

};
STATIC_ASSERT(sizeof(HackingMenu) == 0x1DC);

// 144
class VATSMenu : public Menu	// 1056
{
public:
	VATSMenu();
	~VATSMenu();

	struct VATSAction;

	UInt32						unk028;			// 028
	TileImage					*unk02C;		// 02C
	TileImage					*unk030;		// 030
	TileImage					*unk034;		// 034
	TileImage					*unk038;		// 038
	TileImage					*unk03C;		// 03C
	TileImage					*unk040;		// 040
	TileImage					*unk044;		// 044
	TileImage					*unk048;		// 048
	TileImage					*unk04C;		// 04C
	TileImage					*unk050;		// 050
	TileText					*unk054;		// 054
	TileText					*unk058;		// 058
	TileText					*unk05C;		// 05C
	TileText					*unk060;		// 060
	TileImage					*unk064;		// 064
	TileImage					*unk068;		// 068
	TileImage					*unk06C;		// 06C
	TileImage					*unk070;		// 070
	TileText					*unk074;		// 074
	TileRect					*unk078;		// 078
	TileRect					*unk07C;		// 07C
	TileRect					*unk080;		// 080
	TileImage					*unk084;		// 084
	TileRect					*unk088;		// 088
	TileImage					*unk08C;		// 08C
	TileImage					*unk090;		// 090
	TileImage					*unk094;		// 094
	TileImage					*unk098;		// 098
	TileText					*unk09C;		// 09C
	TileImage					*unk0A0;		// 0A0
	TileImage					*unk0A4;		// 0A4
	UInt32						unk0A8[2];		// 0A8
	BSSimpleList<VATSAction>	queuedActions;	// 0B0
	TileImage					*unk0BC;		// 0BC
	TileImage					*unk0C0;		// 0C0
	TileImage					*unk0C4;		// 0C4
	UInt32						unk0C8[24];		// 0C8
	TESObjectREFR				*targetRef;		// 128
	UInt32						unk12C;			// 12C
	void						*unk130;		// 130
	UInt32						unk134[4];		// 134
};
STATIC_ASSERT(sizeof(VATSMenu) == 0x144);

// 0FC
class ComputersMenu : public Menu	// 1057
{
public:
	ComputersMenu();
	~ComputersMenu();

	UInt32				unk028[33];		// 028
	TESObjectREFR		*targetRef;		// 0AC
	UInt32				unk0B0[19];		// 0B0
};
STATIC_ASSERT(sizeof(ComputersMenu) == 0xFC);

// 088
class CompanionWheelMenu : public Menu	// 1075
{
public:
	CompanionWheelMenu();
	~CompanionWheelMenu();

	UInt32				unk028[16];		// 028
	Actor				*companionRef;	// 068
	UInt32				unk06C[7];		// 06C
};
STATIC_ASSERT(sizeof(CompanionWheelMenu) == 0x88);

// 138
class Sky
{
public:
	Sky();
	~Sky();

	virtual void	Destructor(void);

	NiNode			*niNode04;			// 00
	NiNode			*niNode08;			// 04
	TESClimate		*firstClimate;		// 08
	TESWeather		*firstWeather;		// 0C
	TESWeather		*weather14;			// 10
	TESWeather		*weather18;			// 14
	TESWeather		*weatherOverride;	// 18
	UInt32			atmosphere;			// 1C	* class Atmosphere
	UInt32			stars;				// 20	* class Stars
	UInt32			sun;				// 24	* class Sun
	UInt32			clouds;				// 28	* class Clouds
	UInt32			masserMoon;			// 2C	* class Moon
	UInt32			secundaMoon;		// 30	* class Moon
	UInt32			precipitation;		// 34	* class Precipitation
	UInt32			unk3C[63];			// 38

	static Sky *GetSingleton();
	void RefreshClimate(TESClimate *climate);
};
STATIC_ASSERT(sizeof(Sky) == 0x138);

// C4
class TES
{
public:
	TES();
	~TES();

	UInt32		unk00[49];
};
STATIC_ASSERT(sizeof(TES) == 0xC4);

typedef bool (*_IsMenuMode)(void);
typedef Sky *(*_Sky_GetSingleton)(void);
#if RUNTIME_VERSION == RUNTIME_VERSION_1_4_0_525
IDebugLog gLog("jip_nvse.log");
static const UInt32 s_InjectXML = 0xA01B00;
static const UInt32 s_Sky_RefreshClimate = 0x63C8F0;
static const UInt32 s_TES_GetTerrainHeight = 0x4572E0;
static const UInt32 s_GetInventoryItem = 0x5754A0;
static const UInt32 s_TESModelTextureSwapVtbl = 0x101D124;
static const UInt32 s_ExtraLinkedRefVtbl = 0x1015CC0;
static const UInt32 s_ExtraPrimitiveVtbl = 0x10151B4;
static const UInt32 s_BGSPrimitiveVtbl[3] = {0x101E8C4, 0x101EA64, 0x101E75C};
static const Cmd_Execute Cmd_SetStage_Execute = (Cmd_Execute)0x5C7140;
